/*
 * ----------------------------------------------
 *      위상 정렬 (폐쇄로에 대한 판정 포함)     *
 * ----------------------------------------------
 */
#include <stdio.h>

#define N 8                             /* 정점의 수 */

int a[N+1][N+1]={{0,0,0,0,0,0,0,0,0},   /* 인접행렬 */
                 {0,0,0,1,0,0,0,0,0},
                 {0,1,0,0,0,1,0,0,0},
                 {0,0,0,0,1,0,0,1,0},
                 {0,0,0,0,0,0,0,0,0},
                 {0,0,0,0,1,0,1,0,0},
                 {0,0,0,0,0,0,0,1,1},
                 {0,0,0,0,0,0,0,0,0},
                 {0,0,0,0,0,0,0,1,0}};
int v[N+1],                             /* 방문 플래그 */
    s[N+1];                             /* 정렬결과 저장용 배열 */

void visit(int);

int main(void)
{
    int i;

    for (i=1;i<=N;i++)
        v[i]=0;
    for (i=1;i<=N;i++)
        if (v[i]==0)
            visit(i);
    for (i=N;i>=1;i--)
        printf("%d ",s[i]);

	printf("\n");
	return 0;
}

void visit(int i)
{
    int j;
    static int sp=1;    /* 스택포인터 */
    v[i]=1;
    for (j=1;j<=N;j++) {
        if (a[i][j]==1 && v[j]==0)
            visit(j);
        if (a[i][j]==1 && v[j]==1) {
            printf("%d 와(과) %d 의 근처에 루프가 있습니다.\n",i,j);
            exit(1);
        }
    }
    v[i]=2;             /* 폐쇄로 판정을 위해 2로 설정 */
    s[sp++]=i;          /* 스택에 저장   */
}

