/*
 * -----------------------------------
 *      그래프의 탐색 (너비우선)     *
 * -----------------------------------
 */

#include <stdio.h>

#define N 8                                 /* 정점의 수 */

int a[N+1][N+1]={{0,0,0,0,0,0,0,0,0},       /* 인접행렬 */
                 {0,0,1,0,0,0,0,0,0},
                 {0,1,0,1,1,1,0,0,0},
                 {0,0,1,0,0,0,0,1,0},
                 {0,0,1,0,0,0,0,0,0},
                 {0,0,1,0,0,0,1,0,0},
                 {0,0,0,0,0,1,0,1,1},
                 {0,0,0,1,0,0,1,0,1},
                 {0,0,0,0,0,0,1,1,0}};
int v[N+1];                                 /* 방문 플래그 */

int queue[100];             /* 큐 */
int head=0,                 /* 첫 데이터의 인덱스 */
    tail=0;                 /* 마지막 데이터의 인덱스 */


int main(void)
{
    int i,j,p;

    for (p=1;p<=N;p++) {
        for (i=1;i<=N;i++)
            v[i]=0;
        head=tail=0;
        queue[tail++]=p;v[p]=1;
        do {
            i=queue[head++];            /* 큐에서 추출 */
            for (j=1;j<=N;j++) {
                if (a[i][j]==1 && v[j]==0) {
                    printf("%d->%d ",i,j);
                    queue[tail++]=j;    /* 큐에 저장 */
                    v[j]=1;
                }
            }
        } while (head!=tail);
        printf("\n");
    }

	return 0;
}

